jtn0123/ESP32-S3-display-dashboard/sdkconfig.defaults
# ESP32-S3 specific
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_BOOTLOADER_SPI_FLASH_SIZE_16MB=y
CONFIG_BOOTLOADER_SPI_FLASH_SIZE_AUTO=n

# Enable both CPUs
CONFIG_FREERTOS_UNICORE=n

# Partition Table - Use default two OTA partition table
CONFIG_PARTITION_TABLE_CUSTOM=n
CONFIG_PARTITION_TABLE_TWO_OTA=y
CONFIG_PARTITION_TABLE_SINGLE_APP=n

# OTA Configuration
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

# Increase main task stack size to 12KB for ESP_LCD
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# Increase system event task stack
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Enable thread local storage for LVGL (if used)
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1

# Enable panic handler
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_FLASH=y
CONFIG_ESP_DEBUG_STUBS_ENABLE=y

# Optimize for performance (may help with single DROM segment)
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE is not set

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# WiFi
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_TX_BA_WIN=6
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_RX_BA_WIN=6

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# FreeRTOS tick rate (1000 Hz for smoother animations)
CONFIG_FREERTOS_HZ=1000

# Enable console output
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# NVS for configuration storage
CONFIG_NVS_ENCRYPTION=n

# Reduce bootloader log verbosity
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Enable core dump to flash
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# Enable PSRAM (8MB on T-Display-S3)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Disable unused features to save space
CONFIG_ESP32S3_TRAX=n
CONFIG_ESP32S3_TRACEMEM_RESERVE_DRAM=0

# Force bootloader rebuild every time
CONFIG_BOOTLOADER_REBUILD=y
# Auto-reset after flashing
CONFIG_ESPTOOLPY_AFTER_RESET=y
CONFIG_ESPTOOLPY_AFTER="hard_reset"

# USB CDC settings for proper boot
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Merge rodata segments to avoid multiple DROM segments
CONFIG_APP_BUILD_USE_FLASH_SECTIONS=y
CONFIG_APP_RODATA_SEGMENT_MERGE=y
